Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
 [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-05-19T06:19:58Z" -> null
      - force_detach_policies = true -> null
      - id                    = "pgxflow-backend-pharmcat-getResultsURL" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "pgxflow-backend-pharmcat-getResultsURL" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all              = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - unique_id             = "AROAXHM7ZAGKN5W6CJ7NN" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "pgxflow-backend-pharmcat-getResultsURL-0" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "s3:GetObject"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/clinical-workflows/*"
                        },
                      - {
                          - Action   = "s3:ListBucket"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006"
                        },
                      - {
                          - Action   = "dynamodb:GetItem"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-project-users"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "pgxflow-backend-pharmcat-getResultsURL-logs" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-pharmcat-getResultsURL:*:*",
                              - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-pharmcat-getResultsURL:*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.aws_iam_role_policy.additional_jsons[0] will be destroyed
  # (because aws_iam_role_policy.additional_jsons is not in configuration)
  - resource "aws_iam_role_policy" "additional_jsons" {
      - id          = "pgxflow-backend-pharmcat-getResultsURL:pgxflow-backend-pharmcat-getResultsURL-0" -> null
      - name        = "pgxflow-backend-pharmcat-getResultsURL-0" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/clinical-workflows/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006"
                    },
                  - {
                      - Action   = "dynamodb:GetItem"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-project-users"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-pharmcat-getResultsURL" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.aws_iam_role_policy.logs[0] will be destroyed
  # (because aws_iam_role_policy.logs is not in configuration)
  - resource "aws_iam_role_policy" "logs" {
      - id          = "pgxflow-backend-pharmcat-getResultsURL:pgxflow-backend-pharmcat-getResultsURL-logs" -> null
      - name        = "pgxflow-backend-pharmcat-getResultsURL-logs" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-pharmcat-getResultsURL:*:*",
                          - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-pharmcat-getResultsURL:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-pharmcat-getResultsURL" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.aws_lambda_function.this[0] will be destroyed
  # (because aws_lambda_function.this is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat-getResultsURL" -> null
      - code_sha256                    = "q974igDDSNoJh+fKs9mnef7IYhg1qAFpVJKiESKoO5c=" -> null
      - description                    = "Returns the presigned results URL for PGxFlow pharmcat results" -> null
      - filename                       = "builds/d2df92fff5a868bbdcaf874e61c535d70bbb9fa96753eef0590fbd1a82bdae0a.zip" -> null
      - function_name                  = "pgxflow-backend-pharmcat-getResultsURL" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "pgxflow-backend-pharmcat-getResultsURL" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat-getResultsURL/invocations" -> null
      - last_modified                  = "2025-07-15T04:02:33.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:8",
        ] -> null
      - memory_size                    = 1792 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat-getResultsURL:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat-getResultsURL:$LATEST/invocations" -> null
      - region                         = "ap-southeast-3" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::496940679572:role/pgxflow-backend-pharmcat-getResultsURL" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "q974igDDSNoJh+fKs9mnef7IYhg1qAFpVJKiESKoO5c=" -> null
      - source_code_size               = 762 -> null
      - tags                           = {
          - "Environment"           = "dev"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - tags_all                       = {
          - "Environment"           = "dev"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - timeout                        = 28 -> null
      - version                        = "$LATEST" -> null
        # (4 unchanged attributes hidden)

      - environment {
          - variables = {
              - "DPORTAL_BUCKET"             = "gaspi-dataportal20250519062439005900000006"
              - "DYNAMO_PROJECT_USERS_TABLE" = "sbeacon-dataportal-project-users"
              - "RESULT_SUFFIX"              = "_pharmcat_results.json"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/pgxflow-backend-pharmcat-getResultsURL" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "439852835866696331" -> null
      - triggers = {
          - "filename"  = "builds/d2df92fff5a868bbdcaf874e61c535d70bbb9fa96753eef0590fbd1a82bdae0a.zip"
          - "timestamp" = "1748827737917303000"
        } -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/pgxflow-backend-pharmcat-gnomad"
        name              = "/aws/lambda/pgxflow-backend-pharmcat-gnomad"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "pgxflow-backend-pharmcat-gnomad"
        name                  = "pgxflow-backend-pharmcat-gnomad"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-pharmcat-gnomad:pgxflow-backend-pharmcat-gnomad-0"
        name        = "pgxflow-backend-pharmcat-gnomad-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250519061931564000000002/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/clinical-workflows/*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat-sendJobEmail"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat-gnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:8",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:4",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DPORTAL_BUCKET"           = "gaspi-dataportal20250519062439005900000006"
              - "DYNAMO_CLINIC_JOBS_TABLE" = "sbeacon-dataportal-clinic-jobs"
              - "PGXFLOW_BUCKET"           = "pgxflow-backend-20250519061931564000000002"
              - "RESULT_SUFFIX"            = "_pharmcat_results.json"
              - "SEND_JOB_EMAIL_ARN"       = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat-sendJobEmail"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4012586113412292420" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748827738013844000" -> "1754276085637638000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because aws_cloudwatch_log_group.lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-initPharmcat" -> null
      - id                = "/aws/lambda/pgxflow-backend-initPharmcat" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/pgxflow-backend-initPharmcat" -> null
      - region            = "ap-southeast-3" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all          = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::496940679572:role/pgxflow-backend-initPharmcat" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-05-19T06:20:01Z" -> null
      - force_detach_policies = true -> null
      - id                    = "pgxflow-backend-initPharmcat" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "pgxflow-backend-initPharmcat" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all              = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - unique_id             = "AROAXHM7ZAGKDIMQEW3T6" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "pgxflow-backend-initPharmcat-0" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action    = "s3:ListBucket"
                          - Condition = {
                              - StringLike = {
                                  - "s3:prefix" = "projects/*/project-files/*"
                                }
                            }
                          - Effect    = "Allow"
                          - Resource  = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006"
                        },
                      - {
                          - Action   = "s3:GetObject"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/project-files/*"
                        },
                      - {
                          - Action   = "dynamodb:GetItem"
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-project-users",
                              - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/pgxflow-references",
                            ]
                        },
                      - {
                          - Action   = [
                              - "dynamodb:UpdateItem",
                              - "dynamodb:PutItem",
                              - "dynamodb:GetItem",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs"
                        },
                      - {
                          - Action   = "lambda:InvokeFunction"
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-preprocessor",
                              - "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat-sendJobEmail",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "pgxflow-backend-initPharmcat-logs" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-initPharmcat:*:*",
                              - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-initPharmcat:*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.aws_iam_role_policy.additional_jsons[0] will be destroyed
  # (because aws_iam_role_policy.additional_jsons is not in configuration)
  - resource "aws_iam_role_policy" "additional_jsons" {
      - id          = "pgxflow-backend-initPharmcat:pgxflow-backend-initPharmcat-0" -> null
      - name        = "pgxflow-backend-initPharmcat-0" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = "projects/*/project-files/*"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "dynamodb:GetItem"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-project-users",
                          - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/pgxflow-references",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-preprocessor",
                          - "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat-sendJobEmail",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-initPharmcat" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.aws_iam_role_policy.logs[0] will be destroyed
  # (because aws_iam_role_policy.logs is not in configuration)
  - resource "aws_iam_role_policy" "logs" {
      - id          = "pgxflow-backend-initPharmcat:pgxflow-backend-initPharmcat-logs" -> null
      - name        = "pgxflow-backend-initPharmcat-logs" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-initPharmcat:*:*",
                          - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-initPharmcat:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-initPharmcat" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.aws_lambda_function.this[0] will be destroyed
  # (because aws_lambda_function.this is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-initPharmcat" -> null
      - code_sha256                    = "9oUPa792TdibT11c7Nk3NoIvf7XQ7oddxYkvq2zdJFQ=" -> null
      - description                    = "Initializes a PGxFlow PharmCat run" -> null
      - filename                       = "builds/f624e087a9adeb61f30f12719dda195ef2bafbcd7ffa959ce2d4ae3450aa660d.zip" -> null
      - function_name                  = "pgxflow-backend-initPharmcat" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "pgxflow-backend-initPharmcat" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-initPharmcat/invocations" -> null
      - last_modified                  = "2025-07-15T04:04:28.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:8",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:4",
        ] -> null
      - memory_size                    = 1792 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-initPharmcat:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-initPharmcat:$LATEST/invocations" -> null
      - region                         = "ap-southeast-3" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::496940679572:role/pgxflow-backend-initPharmcat" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "9oUPa792TdibT11c7Nk3NoIvf7XQ7oddxYkvq2zdJFQ=" -> null
      - source_code_size               = 1502 -> null
      - tags                           = {
          - "Environment"           = "dev"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - tags_all                       = {
          - "Environment"           = "dev"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - timeout                        = 28 -> null
      - version                        = "$LATEST" -> null
        # (4 unchanged attributes hidden)

      - environment {
          - variables = {
              - "DRUGS"                                = null
              - "DYNAMO_CLINIC_JOBS_TABLE"             = "sbeacon-dataportal-clinic-jobs"
              - "DYNAMO_PGXFLOW_REFERENCES_TABLE"      = "pgxflow-references"
              - "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              - "GENES"                                = null
              - "HTS_S3_HOST"                          = "s3.ap-southeast-3.amazonaws.com"
              - "ORGANISATIONS"                        = jsonencode([])
              - "PGXFLOW_PHARMCAT_PREPROCESSOR_LAMBDA" = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-preprocessor"
              - "SEND_JOB_EMAIL_ARN"                   = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat-sendJobEmail"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/pgxflow-backend-initPharmcat" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "7464464118691466105" -> null
      - triggers = {
          - "filename"  = "builds/f624e087a9adeb61f30f12719dda195ef2bafbcd7ffa959ce2d4ae3450aa660d.zip"
          - "timestamp" = "1752551957189754000"
        } -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/pgxflow-backend-pharmcat"
        name              = "/aws/lambda/pgxflow-backend-pharmcat"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "pgxflow-backend-pharmcat"
        name                  = "pgxflow-backend-pharmcat"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-pharmcat:pgxflow-backend-pharmcat-0"
        name        = "pgxflow-backend-pharmcat-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250519061931564000000002"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250519061931564000000002/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-postprocessor",
                          - "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat-sendJobEmail",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat"
      ~ image_uri                      = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers@sha256:9d9e8430ae2abca42666eaf78935dad7c851283dd6520da5fa5fd8da0b05401f" -> (known after apply)
      ~ last_modified                  = "2025-07-15T04:03:40.000+0000" -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DYNAMO_CLINIC_JOBS_TABLE"              = "sbeacon-dataportal-clinic-jobs"
              - "PGXFLOW_BUCKET"                        = "pgxflow-backend-20250519061931564000000002"
              - "PGXFLOW_PHARMCAT_POSTPROCESSOR_LAMBDA" = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-postprocessor"
              - "SEND_JOB_EMAIL_ARN"                    = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat-sendJobEmail"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/pgxflow-backend-postprocessor"
        name              = "/aws/lambda/pgxflow-backend-postprocessor"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "pgxflow-backend-postprocessor"
        name                  = "pgxflow-backend-postprocessor"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-postprocessor:pgxflow-backend-postprocessor-0"
        name        = "pgxflow-backend-postprocessor-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::pgxflow-backend-20250519061931564000000002",
                          - "arn:aws:s3:::gaspi-dataportal20250519062439005900000006",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250519061931564000000002/*"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat-sendJobEmail",
                          - "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat-gnomad",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/1f677891b48ace69e4786e26b02d9661cd5cc377d9d42d6b8c371b54c2cbd061.zip" -> "builds/75a34daa0e26de4b6399744b6892c81bef10ac74d5555270aeaf1afaaa68f86f.zip"
        id                             = "pgxflow-backend-postprocessor"
      ~ last_modified                  = "2025-07-15T04:03:33.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:8",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_libraries_layer:3",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:4",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DPORTAL_BUCKET"                 = "gaspi-dataportal20250519062439005900000006"
              - "DRUGS"                          = null
              - "DYNAMO_CLINIC_JOBS_TABLE"       = "sbeacon-dataportal-clinic-jobs"
              - "GENES"                          = null
              - "HTS_S3_HOST"                    = "s3.ap-southeast-3.amazonaws.com"
              - "ORGANISATIONS"                  = jsonencode([])
              - "PGXFLOW_BUCKET"                 = "pgxflow-backend-20250519061931564000000002"
              - "PGXFLOW_PHARMCAT_GNOMAD_LAMBDA" = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat-gnomad"
              - "RESULT_SUFFIX"                  = "_pharmcat_results.json"
              - "SEND_JOB_EMAIL_ARN"             = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat-sendJobEmail"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_pharmcat/lambda/postprocessor",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/75a34daa0e26de4b6399744b6892c81bef10ac74d5555270aeaf1afaaa68f86f.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/75a34daa0e26de4b6399744b6892c81bef10ac74d5555270aeaf1afaaa68f86f.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7340508587217520607" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/1f677891b48ace69e4786e26b02d9661cd5cc377d9d42d6b8c371b54c2cbd061.zip" -> "builds/75a34daa0e26de4b6399744b6892c81bef10ac74d5555270aeaf1afaaa68f86f.zip"
          ~ "timestamp" = "1751933428789506000" -> "1754276085428160000"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/pgxflow-backend-preprocessor"
        name              = "/aws/lambda/pgxflow-backend-preprocessor"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "pgxflow-backend-preprocessor"
        name                  = "pgxflow-backend-preprocessor"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-preprocessor:pgxflow-backend-preprocessor-0"
        name        = "pgxflow-backend-preprocessor-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = "projects/*/project-files/*"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = [
                          - "arn:aws:s3:::pgxflow-backend-references-20250519061930040800000001",
                          - "arn:aws:s3:::gaspi-dataportal20250519062439005900000006",
                        ]
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::pgxflow-backend-references-20250519061930040800000001/*",
                          - "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/project-files/*",
                        ]
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250519061931564000000002/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat-sendJobEmail",
                          - "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-preprocessor"
      ~ image_uri                      = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers@sha256:104c27740efff38dabefba4e4eb5a796e7f470820385e595c1669c9b625c211e" -> (known after apply)
      ~ last_modified                  = "2025-07-15T04:04:01.000+0000" -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DPORTAL_BUCKET"           = "gaspi-dataportal20250519062439005900000006"
              - "DYNAMO_CLINIC_JOBS_TABLE" = "sbeacon-dataportal-clinic-jobs"
              - "HTS_S3_HOST"              = "s3.ap-southeast-3.amazonaws.com"
              - "PGXFLOW_BUCKET"           = "pgxflow-backend-20250519061931564000000002"
              - "PGXFLOW_PHARMCAT_LAMBDA"  = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat"
              - "REFERENCE_BUCKET"         = "pgxflow-backend-references-20250519061930040800000001"
              - "SEND_JOB_EMAIL_ARN"       = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat-sendJobEmail"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because aws_cloudwatch_log_group.lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-pharmcat-sendJobEmail" -> null
      - id                = "/aws/lambda/pgxflow-backend-pharmcat-sendJobEmail" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/pgxflow-backend-pharmcat-sendJobEmail" -> null
      - region            = "ap-southeast-3" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all          = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::496940679572:role/pgxflow-backend-pharmcat-sendJobEmail" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-06-06T06:13:23Z" -> null
      - force_detach_policies = true -> null
      - id                    = "pgxflow-backend-pharmcat-sendJobEmail" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "pgxflow-backend-pharmcat-sendJobEmail" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all              = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - unique_id             = "AROAXHM7ZAGKH2SUIPLG7" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "pgxflow-backend-pharmcat-sendJobEmail-0" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "lambda:InvokeFunction"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:lambda:ap-southeast-3:496940679572:function:cognito-sendClinicJobEmail"
                        },
                      - {
                          - Action   = [
                              - "dynamodb:UpdateItem",
                              - "dynamodb:PutItem",
                              - "dynamodb:GetItem",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs"
                        },
                      - {
                          - Action   = "cognito-idp:ListUsers"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:cognito-idp:ap-southeast-3:496940679572:userpool/ap-southeast-3_Ta5TVYZ4S"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "pgxflow-backend-pharmcat-sendJobEmail-logs" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-pharmcat-sendJobEmail:*:*",
                              - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-pharmcat-sendJobEmail:*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.aws_iam_role_policy.additional_jsons[0] will be destroyed
  # (because aws_iam_role_policy.additional_jsons is not in configuration)
  - resource "aws_iam_role_policy" "additional_jsons" {
      - id          = "pgxflow-backend-pharmcat-sendJobEmail:pgxflow-backend-pharmcat-sendJobEmail-0" -> null
      - name        = "pgxflow-backend-pharmcat-sendJobEmail-0" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:496940679572:function:cognito-sendClinicJobEmail"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:496940679572:userpool/ap-southeast-3_Ta5TVYZ4S"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-pharmcat-sendJobEmail" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.aws_iam_role_policy.logs[0] will be destroyed
  # (because aws_iam_role_policy.logs is not in configuration)
  - resource "aws_iam_role_policy" "logs" {
      - id          = "pgxflow-backend-pharmcat-sendJobEmail:pgxflow-backend-pharmcat-sendJobEmail-logs" -> null
      - name        = "pgxflow-backend-pharmcat-sendJobEmail-logs" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-pharmcat-sendJobEmail:*:*",
                          - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-pharmcat-sendJobEmail:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-pharmcat-sendJobEmail" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.aws_lambda_function.this[0] will be destroyed
  # (because aws_lambda_function.this is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat-sendJobEmail" -> null
      - code_sha256                    = "zVLc1/VeZruNerU7GHxyETc0fdwjyv93EuMwyS8SF74=" -> null
      - description                    = "Invokes sendJobEmail to send email to user" -> null
      - filename                       = "builds/50e51e6fd6cd0390dc575643043f2399289d1e995c0e48302f5a50335b0fc2ba.zip" -> null
      - function_name                  = "pgxflow-backend-pharmcat-sendJobEmail" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "pgxflow-backend-pharmcat-sendJobEmail" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat-sendJobEmail/invocations" -> null
      - last_modified                  = "2025-07-15T04:02:45.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:8",
        ] -> null
      - memory_size                    = 1792 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat-sendJobEmail:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat-sendJobEmail:$LATEST/invocations" -> null
      - region                         = "ap-southeast-3" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::496940679572:role/pgxflow-backend-pharmcat-sendJobEmail" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "zVLc1/VeZruNerU7GHxyETc0fdwjyv93EuMwyS8SF74=" -> null
      - source_code_size               = 1071 -> null
      - tags                           = {
          - "Environment"           = "dev"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - tags_all                       = {
          - "Environment"           = "dev"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - timeout                        = 28 -> null
      - version                        = "$LATEST" -> null
        # (4 unchanged attributes hidden)

      - environment {
          - variables = {
              - "COGNITO_CLINIC_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:496940679572:function:cognito-sendClinicJobEmail"
              - "DYNAMO_CLINIC_JOBS_TABLE"        = "sbeacon-dataportal-clinic-jobs"
              - "USER_POOL_ID"                    = "ap-southeast-3_Ta5TVYZ4S"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/pgxflow-backend-pharmcat-sendJobEmail" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "3771433597359826641" -> null
      - triggers = {
          - "filename"  = "builds/50e51e6fd6cd0390dc575643043f2399289d1e995c0e48302f5a50335b0fc2ba.zip"
          - "timestamp" = "1751933428860594000"
        } -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/pgxflow-backend-pharmcat-updateReferenceFiles"
        name              = "/aws/lambda/pgxflow-backend-pharmcat-updateReferenceFiles"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "pgxflow-backend-pharmcat-updateReferenceFiles"
        name                  = "pgxflow-backend-pharmcat-updateReferenceFiles"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:8",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1428769914234627424" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751933428611199000" -> "1754276085506678200"
            # (1 unchanged element hidden)
        }
    }

Plan: 164 to add, 226 to change, 151 to destroy.
╷
╵

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: uat04-plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "uat04-plan.out"
❌ Terraform plan creation failed
❌ Terraform plan failed
❌ Main execution failed
ℹ️  Cleaning up sensitive files
✅ Cleanup completed
❌ Script failed with exit code: 1


```
</details>